[
  {
    "id": 1,
    "brandName": "Microsoft",
    "logo": "https://www.microsoft.com/favicon.ico",
    "jobTitle": "Software Engineer",
    "location": "Redmond, WA",
    "salary": "$120,000 - $150,000",
    "phone": "123-456-7890",
    "email": "jobs@microsoft.com",
    "jobStyle": "Remote",
    "jobDescription": "As a software engineer at Microsoft, you'll work on cutting-edge technologies like artificial intelligence, cloud computing, and more, while collaborating with a team of experts to solve complex technical problems.",
    "jobResponsibility": "Design and implement software solutions using best practices and emerging technologies. Collaborate with cross-functional teams to define and implement new features. Write clean, scalable, and maintainable code.",
    "educationalRequirement": "Bachelor's or Master's degree in Computer Science or a related field.",
    "experience": "2+ years of experience in software engineering."
  },
  {
    "id": 2,
    "brandName": "Tesla",
    "logo": "https://images.unsplash.com/photo-1610501693690-64414e727fe3?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxzZWFyY2h8Mnx8dGVzbGElMjBsb2dvJTIwb24lMjB0ZXh0fGVufDB8fDB8fA%3D%3D&auto=format&fit=crop&w=500&q=60",
    "jobTitle": "Mechanical Engineer",
    "location": "Fremont, CA",
    "salary": "$90,000 - $120,000",
    "phone": "111-222-3333",
    "email": "jobs@tesla.com",
    "jobStyle": "Remote",

    "jobDescription": "As a mechanical engineer at Tesla, you'll work on designing and developing innovative solutions for electric vehicles and sustainable energy products, while collaborating with a team of experts to tackle complex engineering challenges.",
    "jobResponsibility": "Design, develop, and test mechanical systems and components for electric vehicles and energy products. Collaborate with cross-functional teams to develop and implement new product features. Conduct analysis and simulations to optimize product performance.",
    "educationalRequirement": "Bachelor's or Master's degree in Mechanical Engineering or a related field.",
    "experience": "3+ years of experience in mechanical engineering."
  },
  {
    "id": 3,
    "brandName": "Amazon",
    "logo": "https://www.amazon.com/favicon.ico",
    "jobTitle": "Operations Manager",
    "location": "Seattle, WA",
    "salary": "$100,000 - $130,000",
    "phone": "444-555-6666",
    "jobStyle": "OnSite",
    "email": "jobs@amazon.com",
    "jobDescription": "As an operations manager at Amazon, you'll be responsible for driving operational excellence and delivering outstanding customer experiences, while collaborating with a team of professionals to optimize processes and innovate new solutions.",
    "jobResponsibility": "Lead and manage a team of associates to deliver operational excellence and exceptional customer service. Identify and implement process improvements to enhance operational efficiency and effectiveness. Develop and maintain relationships with internal and external stakeholders.",
    "educationalRequirement": "Bachelor's or Master's degree in Business Administration, Operations Management, or a related field.",
    "experience": "5+ years of experience in operations management."
  },
  {
    "id": 4,
    "brandName": "Apple",
    "logo": "https://images.unsplash.com/photo-1621768216002-5ac171876625?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8YXBwbGUlMjBicmFuZCUyMGxvZ298ZW58MHx8MHx8&auto=format&fit=crop&w=500&q=60",
    "jobTitle": "iOS Developer",
    "location": "Cupertino, CA",
    "salary": "$110,000 - $140,000",
    "phone": "777-888-9999",
    "email": "jobs@apple.com",
    "jobStyle": "Remote",

    "jobDescription": " As an iOS developer at Apple, you'll work on designing and developing innovative software applications for Apple's mobile devices, while collaborating with a team of experts to deliver world-class user experiences.",
    "jobResponsibility": "Design and develop high-quality mobile applications for the iOS platform. Collaborate with cross-functional teams to implement new features and improve existing ones. Write clean, efficient, and maintainable code that adheres to Apple's coding standards.",
    "educationalRequirement": "Bachelor's or Master's degree in Computer Science or a related field.",
    "experience": "3+ years of experience in iOS development."
  },
  {
    "id": 5,
    "brandName": "Google",
    "logo": "https://www.google.com/favicon.ico",
    "jobTitle": "Data Analyst",
    "location": "Mountain View, CA",
    "salary": "$90,000 - $120,000",
    "phone": "000-111-2222",
    "email": "jobs@google.com",
    "jobStyle": "OnSite",

    "jobDescription": "As a data analyst at Google, you'll use your analytical skills to provide insights that drive business decisions and improve products and services, while collaborating with cross-functional teams to identify and solve complex problems.",
    "jobResponsibility": "Collect, analyze, and interpret large data sets to provide insights that drive business decisions. Collaborate with cross-functional teams to identify opportunities for data-driven improvements. Design and implement data models and visualizations to communicate insights effectively.",
    "educationalRequirement": "Bachelor's or Master's degree in Mathematics, Statistics, Computer Science, or a related field.",
    "experience": "2+ years of experience in data analysis."
  },
  {
    "id": 6,
    "brandName": "Facebook",
    "logo": "https://www.facebook.com/images/fb_icon_325x325.png",
    "jobTitle": "Product Manager",
    "location": "Menlo Park, CA",
    "salary": "$120,000 - $160,000",
    "phone": "555-666-7777",
    "email": "jobs@facebook.com",
    "jobStyle": "Remote",
    "jobDescription": "As a product manager at Facebook, you'll work on defining and executing the product strategy for one of our key products, while collaborating with cross-functional teams to deliver innovative and impactful solutions.",
    "jobResponsibility": "Lead the product strategy, roadmap, and execution for one of our key products. Work with cross-functional teams to define product requirements and prioritize feature development. Analyze market trends and customer feedback to identify product improvement opportunities.",
    "educationalRequirement": "Bachelor's or Master's degree in Computer Science, Business Administration, or a related field.",
    "experience": "5+ years of experience in product management or related roles."
  },

  {
    "id": 7,
    "brandName": "Netflix",
    "logo": "https://www.freepnglogos.com/uploads/netflix-logo-circle-png-5.png",
    "jobTitle": "Content Marketing Manager",
    "location": "Los Gatos, CA",
    "salary": "$100,000 - $130,000",
    "phone": "888-999-0000",
    "email": "jobs@netflix.com",
    "jobStyle": "OnSite",
    "jobDescription": "As a content marketing manager at Netflix, you'll work on creating and executing marketing strategies to promote our original content, while collaborating with cross-functional teams to drive customer engagement and retention.",
    "jobResponsibility": "Create and execute marketing campaigns to promote our original content across various channels. Develop messaging and positioning for our shows and films. Analyze customer data and feedback to optimize marketing strategies.",
    "educationalRequirement": "Bachelor's or Master's degree in Marketing, Communications, or a related field.",
    "experience": "5+ years of experience in content marketing or related roles."
  },

  {
    "id": 8,
    "brandName": "SpaceX",
    "logo": "https://www.spacex.com/static/images/share.jpg",
    "jobTitle": "Aerospace Engineer",
    "location": "Hawthorne, CA",
    "salary": "$100,000 - $140,000",
    "phone": "222-333-4444",
    "email": "jobs@spacex.com",
    "jobStyle": "OnSite",
    "jobDescription": "As an aerospace engineer at SpaceX, you'll work on designing and developing cutting-edge rockets and spacecraft, while collaborating with a team of experts to revolutionize space exploration.",
    "jobResponsibility": "Design and develop rocket and spacecraft systems, subsystems, and components. Collaborate with cross-functional teams to integrate and test systems. Conduct analysis and simulations to optimize performance and reliability.",
    "educationalRequirement": "Bachelor's or Master's degree in Aerospace Engineering or a related field.",
    "experience": "3+ years of experience in aerospace engineering or related roles."
  }
]
